Repository: terphix/MouseyBot
Catalog: Mousey/Locales/*/LC_MESSAGES/bot.po
Languages: ru

source: Админ меню
ru: Добро пожаловать в админ меню 🐭 Если вы получили доступ сюда, значит вам доверяют 👌 Здесь вы можете: • Рассматривать новости, которые предложили пользователи • Банить нарушителей • Создавать рассылки • И заниматься другими крутыми вещами Выберите необходимую функцию

source: Список админ команд
ru: Вот список всех админ команд 🐭 /admin - команда для вызова этого меню) /database_info - получение статистики из базы данных бота /update_role (роль) - изменение роли пользователя. Доступна только главному администратору! А ещё, если вы отправите мне стикер, то я скижу вам его ID

source: Админ меню новости, информация о новости
ru: 🗞 Информацию о новости 📪 ID: {telegram_id} Адрес пользователя: {telegram_username} Текст новости: {text} Контакты: {contact}

source: Админ меню новости, профиль скрыт
ru: профиль закрыт 👿

source: Админ меню новости, контакт не указан
ru: Пользователь не указал контакты 👾

source: Админ меню новости непрочитанных нет
ru: На сегодня непрочитанных новостей нет 📭 Возвращайтесь позже...

source: Админ меню новости
ru: 📰 Новости 🗞 Рассматривайте новости предложенные пользователя и выбирайте понравившиеся! Если человек нарушает правила, вы можете запретить ему отправлять сообщения с помощью кнопки "Бан"

source: Функция в разработке
ru: Данная функция находится в разработке 🧑‍💻

source: Новость просмотрена
ru: Вы просмотрели новость 👀

source: Админ новости, автор новости забанен
ru: Автор новости заблокирован 🔒

source: Админ новости, автор новости уже был забанен
ru: Не удалось заблокировать пользователя, так как он уже находится в бане 😚

source: Админ новости, нельзя забанить администратора
ru: Не удалось заблокировать пользователя, так как он является администратором 😳

source: Полное главное меню
ru: Привет-привет, меня зовут Мышонок 👋 Добро пожаловать в моё главное меню 🐭 ● Перемещайся по разделам меню с помощью кнопок под сообщение! ● Ты также можешь получить набор крутых и эксклюзивных стикеров, используя секретную команду... ● Список всех команд можно получить, нажав на специальную кнопку возле поля ввода текста)

source: Краткое главное меню
ru: Главное меню, Мышонок на связи, приём 🐭 И вот ты снова здесь! Надеюсь, ты уже успел ознакомиться со всеми моими функциями и написал свою первую новость 📰 Используй кнопки под этим сообщением, чтобы перемещаться по разделам 📌

source: Полезная информация
ru: Самая важная информация специально для вас: Группа школы в Telegram: https://t.me/school5yamo Группа школы в ВК: https://vk.com/public203845699 По вопросам писать: @mandarin_fan Ваш ID: {user_id}

source: Информация о боте
ru: ✨ Информация о боте ⚡️ Имя бота: Мышонок 🐭 Автор: @mandarin_fan Исходный код: https://github.com/terphix/MouseyBot 📅 Бот был запущен 7 ноября, 2024 года Бот сделан совместно с Медиацентром "Пятёрочка" специально для МБОУ "СОШ №5 ЯМО" на день рождения школы На этом всё 🐭

source: Контакты для новости отсутствуют
ru: Контакты для связи с вами не указаны ❗️

source: Шаблон для вставки текста новости
ru: Текст для вашей новости: {text}

source: Шаблон для вставки контактов новости
ru: Контакты для связи с вами: {contact}

source: Шаблон для формы отправки новости
ru: Ваша новость 🌼 {news_text} {news_contact}

source: Неправильная форма данных для новости
ru: Извините, но я могу прочитать только текстовые сообщения 😞

source: Новостное меню
ru: 🥸 У вас есть крутая информация и вы хотите ей поделиться со всеми? 🧐 Тогда вы по адресу! Предлагайте свои новости (не забывайте про правила приличия), а отзывчивая администрация рассмотрит каждую из них и если всё будет хорошо, то опубликует её в школьной группе 😇 Вы можете указать контакты для связи с вами, чтобы администрация бота могла уточнить некоторые моменты и указать вас в качестве автора новости 👤

source: Шаблон для статистики новостей
ru: Самая свежая статистика для вас: Количество отправленных новостей: {all_news} 🔥 Количество новостей на рассмотрении: {unseen_news} ⏰

source: Ввести текст для новости
ru: Напишите мне текст для вашей новости 💬

source: Ввести контакты для новости
ru: Напишите контакты для связи с вами. Это может быть ваш адрес пользователя Telegram, номер телефона, ссылка на ВК и многое другое 🙊

source: Новость успешно отправлена
ru: Ваша новость была успешно отправлена!

source: Вы забанены
ru: вы заблокированы администратором бота 😮

source: Превышен лимит непрочитанных новостей
ru: у вас слишком много предложенных новостей, которые ещё находятся на рассмотрении 🫠 Информация о нерассмотренных новостях можно найти в меню новостей в разделе "Статистика"

source: Шаблон новость не отправлена
ru: Не удалось отправить новость( Причина: {reason}

source: Информация про набор стикеров
ru: Вот ваш очень крутой набор стикеров 😻 Не забудьте поделиться им с друзьями!

source: Отмена выполнения текущей операции
ru: Данная операция была успешно отмечена 🙅‍♂

source: Админ пинг базы данных
ru: Вся информация про БД: Кол-во пользователей: {users_count} Кол-во новостей: {news_count}

source: Обновление роли, необходимо ввести существующую роль
ru: Необходимо ввести существующую роль! Список ролей: {roles} Команда должна выглядеть так: /update_role (РОЛЬ) (ID пользователя)

source: Обновление роли, роль успешно обновлена
ru: Роль была успешно обновлена!
